Repository: Elsheshtawwy/ecommerce
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Ecommerce Exam
ar: اختبار ايكورمس

source: Select Chapter
ar: اختر الفصل الدراسي

source: Chapter One
ar: الفصل الأول

source: Chapter Two
ar: الفصل الثاني

source: Chapter Three
ar: الفصل الثالث

source: Chapter Four
ar: الفصل الرابع

source: Chapter Five
ar: الفصل الخامس

source: Chapter Six
ar: الفصل السادس

source: Chapter Seven
ar: الفصل السابع

source: Select Exam
ar: اختر الاختبار

# examOfChapter
source: Exam {examNumber} of {chapterTitle}
ar: اختبار {examNumber} من {chapterTitle}

# examChapter
source: Chapter {chapterNumber} Exam
ar: اختبار الفصل {chapterNumber}

# selectTfQuestions
source: Select number of True/False questions:
ar: اختر عدد أسئلة الصواب/الخطأ:

# selectedCount
source: Selected Count: {count}
ar: العدد المحدد: {count}

# selectMcQuestions
source: Select number of Multiple Choice questions:
ar: اختر عدد أسئلة الاختيار من متعدد:

# startExam
source: Start the Exam
ar: ابدأ الاختبار

# questionNumber
source: Question {number}: {questionText}
ar: السؤال {number}: {questionText}

# trueOption
source: True
ar: صواب

# falseOption
source: False
ar: خطأ

source: Previous
ar: السابق

source: Next
ar: التالي

source: Finish Exam
ar: إنهاء الاختبار

source: Results
ar: النتائج

# scoreMessage
source: You scored {score} out of {total}
ar: لقد أحرزت {score} من {total}

# perfectScore
source: Wow wow, you aced it! Mashallah!
ar: جعب جعب ما شاء الله

# veryGoodScore
source: Nice! You scored higher than me and I wrote the questions!
ar: عاش والله جبت أعلى مني وأنا اللي داير الاسئلة

# goodScore
source: You passed, you passed habibi, but maybe read again, or pray for a war before the exam!
ar: تمشي تمشي بس عاود اقرا اخرى أو ادعي تصير حرب قبل الامتحان

# tryAgainMessage
source: Still early! You can catch up, inshallah!
ar: لسة بادرييي , تلحق تقرا إن شاء الله

source: Incorrect Answers:
ar: الإجابات الخاطئة:

# questionLabel
source: Question:
ar: السؤال:

# correctAnswerLabel
source: Correct Answer:
ar: الإجابة الصحيحة:

# yourAnswerLabel
source: Your Answer:
ar: إجابتك:

source: Not Answered
ar: لم تجب

# backToHome
source: Back to Home Screen
ar: العودة للصفحة الرئيسية

# pleaseSelectChapters
source: Please select chapters to start the exam.
ar: الرجاء اختيار الفصول لبدء الاختبار.

source: Back
ar: عودة

# questionProgress
source: Question {current} / {total}
ar: السؤال {current} / {total}

source: Show Previous Exams
ar: عرض الاختبارات السابقة
